// нужно написать логику которая проверяет горизонтальную колонку на совпадение чисел от 1 до 9.
// Если в клетке есть число, тогда идём дальше, иначе если клетка пуста подбираем число, которого нет в колонке, переходим дальше до того как длинна массива 9, тогда перехожу к следующей.

const test = [
  [['1'], ['-'], ['5'], ['8'], ['-'], ['2'], ['-'], ['-'], ['-']],
  [['-'], ['9'], ['-'], ['-'], ['7'], ['6'], ['4'], ['-'], ['5']],
  [['2'], ['-'], ['-'], ['4'], ['-'], ['-'], ['8'], ['1'], ['9']],
  [['-'], ['1'], ['9'], ['-'], ['-'], ['7'], ['3'], ['-'], ['6']],
  [['7'], ['6'], ['2'], ['-'], ['8'], ['3'], ['-'], ['9'], ['-']],
  [['-'], ['-'], ['-'], ['-'], ['6'], ['1'], ['-'], ['5'], ['-']],
  [['-'], ['-'], ['7'], ['6'], ['-'], ['-'], ['-'], ['3'], ['-']],
  [['4'], ['3'], ['-'], ['-'], ['2'], ['-'], ['5'], ['-'], ['1']],
  [['6'], ['-'], ['-'], ['3'], ['-'], ['8'], ['9'], ['-'], ['-']],
];
// const column = [];

function checkColumn(arr, column, value) {
  for (let i = 0; i <= 9; i++) {
    if (arr[i][column].includes(String(value))) {
      return false;
    }
  }
  return true;
}

console.log(checkColumn(test, 0, 3));

function returnVal(arr, column) {
  const result = [];
  for (let i = 1; i <= 9; i++) {
    if (checkColumn(arr, column, i)) {
      result.push(String(i));
    }
  }
  return result;
}
console.log(returnVal(test, 0));

// console.log(arr[i][column]);
