// Принимает доску в виде строки в формате
// вы видите в файле головоломки.Возвращает
// нечто, представляющее собой доску после
// ваш решатель пытался решить это.
// То, как вы представляете свою доску, зависит от вас!
function solve(boardString) {
  console.log('first changes');
}

// Возвращает логическое значение, указывающее,
// или решается не указанная плата.
// Плата ввода будет в любом
// форма `решить` возвращает.
function isSolved(board) {

}

// Принимает доску в той или иной форме и
// возвращает правильно отформатированную строку
// для вывода на экран.
// Плата ввода будет в любом
// форма `решить` возвращает.
function prettyBoard(board) {

}

// Exports all the functions to use them in another file.
module.exports = {
  solve,
  isSolved,
  prettyBoard,
};