/**
 * Принимает игровое поле в формате строки — как в файле sudoku-puzzles.txt.
 * Возвращает игровое поле после попытки его решить.
 * Договорись со своей командой, в каком формате возвращать этот результат.
 */
function solve(boardString) {

}

/**
 * Принимает игровое поле в том формате, в котором его вернули из функции solve.
 * Возвращает булевое значение — решено это игровое поле или нет.
 */

const arrBoard = [
  ["1", "2", "3", "1", "2", "3", "1", "2", "3"], ["1", "2", "3", "1", "2", "3", "1", "2", "3"], ["1", "2", "3", "1", "2", "3", "1", "2", "3"], ["1", "2", "3", "1", "2", "3", "1", "2", "3"], ["1", "2", "3", "1", "2", "3", "1", "2", "3"], ["1", "2", "3", "1", "2", "3", "1", "2", "3"], ["1", "2", "3", "1", "2", "3", "1", "2", "3"], ["1", "2", "3", "1", "2", "3", "1", "2", "3"], ["1", "2", "3", "1", "2", "3", "1", "2", "3"]
]
function isSolved(arrBoard) {
  let regular = /\d{9}\W/
  for (let i = 0; i < arrBoard.length; i += 1) {
    for (let i = 0; i < arrBoard[i].length; i += 1) {
      if (arrBoard[i][i].join('').match(regular)) { 
        return true;
      } else {
        return false;
      }
    }
  }
}

console.log(isSolved(arrBoard))

/**
 * Принимает игровое поле в том формате, в котором его вернули из функции solve.
 * Возвращает строку с игровым полем для последующего вывода в консоль.
 * Подумай, как симпатичнее сформировать эту строку.
 */
function prettyBoard(board) {

}

// Экспортировать функции для использования в другом файле (например, readAndSolve.js).
module.exports = {
  solve,
  isSolved,
  prettyBoard,
};
