function read() {
  /**
   * Прочесть файл puzzles.txt в кодировке 'utf-8' и вернуть эти данные из функции
   */
}

function solve() {
  /**
   * Принимает игровое поле в том формате, в котором его вернули из функции read.
   * Возвращает игровое поле после попытки его решить.
   */
}

function isSolved() {
  /**
   * Принимает игровое поле в том формате, в котором его вернули из функции solve.
   * Возвращает булевое значение — решено это игровое поле или нет.
   */
}

const board = 
  [[2, 5, 7, 3, 1, 6, 4, 8, 9],
   [2, 5, 7, 3, 1, 6, 4, 8, 9],
   [2, 5, 7, 3, 1, 6, 4, 8, 9],
   [2, 5, 7, 3, 1, 6, 4, 8, 9],
   [2, 5, 7, 3, 1, 6, 4, 8, 9],
   [2, 5, 7, 3, 1, 6, 4, 8, 9],
   [2, 5, 7, 3, 1, 6, 4, 8, 9],
   [2, 5, 7, 3, 1, 6, 4, 8, 9],
   [2, 5, 7, 3, 1, 6, 4, 8, 9]]

   function prettyBoard(board) {
let newBoard = board.map((row) => row.join(' ')).join('\n');
  return newBoard;
  }

  console.log(prettyBoard(board));

  /**
   * Принимает игровое поле в том формате, в котором его вернули из функции solve. Принимает массивы строк [2, 5, 7, 3, 1, 6, 4, 8, 9] в массиве судоку 
   * 
   * Выводит в консоль/терминал судоку.
   * Подумай, как симпатичнее его вывести.
   */



