// проверяет строку и столбец // num  число которое подставиться
// board - большой массив, pos- это кординаты куда хотим подставить т е позиция числа
// проверяет уникальность строки и столбца
// если по индексу есть число 5 то мы не сможем туда подставить
// определяет какова длинна судоку

  function uniq(num, pos, board) {
    let [x, y] = pos;
    for (let i = 0; i < boardSize; i += 1) {
      if (board[x][i] === num) return false;
      if (board[i][y] === num) return false;
    }
    return true
  }

