const sudoku = require('../sudoku.js')
const { solve, isSolved, prettyBoard } = require('../sudoku.js');

const testSud = '--7--8------2---6-65--79----7----3-5-83---67-2-1----8----71--38-2---5------4--2--';

test('Возвращает не пустой массив', () => {
    expect(solve(testSud)).not.toEqual([]);
  });

  const boardTwo = [
    ['1', '9', '9', '9', '-', '1', '-', '-', '-'], 
    ['1', '9', '9', '9', '-', '2', '-', '-', '-'],
    ['1', '9', '9', '9', '-', '3', '-', '-', '-'],
    ['1', '9', '9', '9', '-', '4', '-', '-', '-'],
    ['1', '9', '9', '9', '-', '5', '-', '-', '-'],
    ['1', '9', '9', '9', '-', '6', '-', '-', '-'],
    ['1', '9', '9', '9', '-', '7', '-', '-', '-'],
    ['1', '9', '9', '9', '-', '8', '-', '-', '-'],
    ['1', '9', '9', '9', '-', '9', '-', '-', '-'],
    ];
    
    describe('Проверяем isSolved()', () => {
        it('Return false', () => {
          expect(isSolved(boardTwo)).toBeFalsy();
        });
      });