/**
 * Принимает игровое поле в формате строки — как в файле sudoku-puzzles.txt.
 * Возвращает игровое поле после попытки его решить.
 * Договорись со своей командой, в каком формате возвращать этот результат.
 * 
 * 1. Из строки сделать двумерный массив
 * 2. Достать информацию из файла puzzle.txt
 * !!! Формат вывода: двумерный массив
 * 
 */

let test = '1-58-2----9--764-52--4--819-19--73-6762-83-9-----61-5---76---3-43--2-5-16--3-89--';

 function solveFromNewFile(test) {
  return (test);
}


module.exports = {
  solveFromNewFile
}